app/views/posts/show.html.erb

  <a href="/posts/<%=@post.id%>/comments/new"><button type="button" name="button">New Comment</button></a>
  <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]