app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
INSERT INTO "comments" ("created_at", "updated_at", "user_id", "post_id", "text") VALUES (?, ?, ?, ?, ?)