app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "oggi"], ["text", "whatever"], ["created_at", "2017-12-20 19:30:09.418123"], ["updated_at", "2017-12-20 19:30:09.418123"], ["user_id", 1]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "update"], ["updated_at", "2017-12-19 20:06:01.728219"], ["id", 1]]